Revit 2027 API
PromptForFamilyInstancePlacementOptions Properties
The PromptForFamilyInstancePlacementOptions type exposes the following members.
Properties
Name | Description
FaceBasedPlacementType |  The placement type to be used if prompting to place an instance of a face-based family. This option is ignored if placing a non-face-based family. If placing a face-based family, Default is an acceptable value, but will correspond to the first available selection in the user interface.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PlaceAirTerminalOnDuct |  If true, when placing an air terminal, the terminal will be placed directly on the duct without fittings. If fase, the terminal will be placed with generated fittings.
SketchGalleryOptions |  The sketch option provided when promt to place a family instance.
Top
See Also
Reference
PromptForFamilyInstancePlacementOptions Class
Autodesk.Revit.UI Namespace